sage: g=incidence_graph([1,1])
sage: w=ig_weights([2,1],[1,1])
sage: w
[0, 2, 4, 1, 2]
sage: for fp in fixed_points_iterator(g,w,3,2):
....:     print bott_term(g,w,fp, [0,1,2,3], [[1],[0]], [[0],[1,1]])
....:     
0
0
0
3
0
0
sage: for fp in fixed_points_iterator(g,w,3,2):
    print bott_term(g,w,fp, [0,1,2,3], [[0],[1]], [[0],[1,1]])
....:     
-3
6
-3
3
0
0
sage: for fp in fixed_points_iterator(g,w,3,2):
....:     print fp
....:     
[[1], [1, 2]]
[[1], [1, 3]]
[[1], [1, 4]]
[[2], [2, 1]]
[[2], [2, 3]]
[[2], [2, 4]]
sage: bott_term(g,w,[[2], [2, 1]], [0,1,2,3], [[0],[1]], [[0],[1,1]])
evaluate_schur( [0] , [-1] )
evaluate_schur( [0] , [0] )
evaluate_schur( [1] , [-1] )
evaluate_schur( [1, 1] , [2, 3] )
3
sage: bott_term(g,w,[[2], [1, 2]], [0,1,2,3], [[0],[1]], [[0],[1,1]])
evaluate_schur( [0] , [-1] )
evaluate_schur( [0] , [0] )
evaluate_schur( [1] , [-1] )
evaluate_schur( [1, 1] , [2, 3] )
3
sage: evaluate_schur( [1, 1] , [2, 3] )
evaluate_schur( [1, 1] , [2, 3] )
xb6
sage: bott_denominator(g,w,[[2], [2, 1]]  ,[0,1,2,3])
-2
sage: bott_denominator(g,w,[[1], [1,2]],[0,1,2,3])
2
sage: bott_denominator(g,w,[[2], [1,2]],[0,1,2,3])
-2
sage: bott_denominator(g,w,[[2], [3,2]],[0,1,2,3])
-4
sage: bott_denominator(g,w,[[1], [1,3]],[0,1,2,3])
-1
sage: bott_term(g,w,[[2], [1, 2]], [0,1,2,3], [[0],[1]], [[0],[1,1]])
StQ_char= [-1]
evaluate_schur( [0] , [-1] )
evaluate_schur( [0] , [0] )
StQ_char= [1, 2]
evaluate_schur( [1] , [-1] )
evaluate_schur( [1, 1] , [2, 3] )
3
sage: 

################################################################################
# After fix: (compare to example from thpaper.tex)
# 
sage: g=incidence_graph([1,1])
sage: w=ig_weights([2,1],[1,1])
sage: for fp in fixed_points_iterator(g,w,3,2):
....:     print bott_term(g,w,fp, [0,1,2,3], [[1],[0]], [[0],[1,1]])
....:     
0
0
0
1
0
0
sage: for fp in fixed_points_iterator(g,w,3,2):
    print bott_term(g,w,fp, [0,1,2,3], [[0],[1]], [[0],[1,1]])
....:     
-3
6
-3
0
0
0
